{
  "title": "Lunaisms_Bad_Day_Vibes",
  "negative_framing": [
    "My life’s satnav is stuck on 'detour to despair,' sending me round the M25 of misery with no service station in sight.",
    "Today’s a BBC Three sitcom written by a hungover intern and cancelled after one episode—starring me, crying in a bus shelter.",
    "I’m not at the end of my tether—I’m knitting it into a scarf of regret while muttering, 'Cheers, universe, you absolute melt.'",
    "I hit rock bottom, then kept digging until I opened a pop-up shop selling 'Existential Dread' candles on Depop.",
    "The universe saw my to-do list and went, 'Hold my pint, let’s make this properly grim.'",
    "I’m in a funk so deep, even Amy Winehouse would say, 'Blimey, love, have a biscuit and sort yourself out.'",
    "Stuck between a quarter-life crisis and my overdraft, both racking up interest faster than a payday loan ad.",
    "It wasn’t a meltdown—it was a one-woman Edinburgh Fringe show called 'Sobbing in Sainsbury’s.'",
    "This day’s so rubbish, my horoscope just said, 'Mate, bin it and try again tomorrow.'"
  ],
  "resilient_framing": [
    "My life’s satnav’s stuck on 'scenic route to chaos,' but I’m enjoying the views and blasting ABBA to cope.",
    "Today’s a Channel 4 reality show flop, but I’m the breakout star, crying in a bus stop with charisma.",
    "I’m not at the end of my tether—I’m weaving it into a trendy macramé wall hanging for my Etsy shop.",
    "Hit rock bottom, but I’m turning it into a quirky basement flat with fairy lights and ironic despair.",
    "The universe chucked my to-do list in the bin, but I’m calling it a minimalist lifestyle now.",
    "I’m in a funk, but it’s got a banging Northern Soul playlist, and I’m dancing through the gloom.",
    "Caught between a quarter-life crisis and my overdraft, but I’m manifesting a glow-up by next payday.",
    "No meltdown here—just a sold-out solo show at the Fringe called 'Cackling Through the Chaos.'",
    "This day’s pants, but my horoscope says tomorrow’s got potential, so I’m sipping tea and staying zen."
  ]
}