{
  "title": "Luna_Five_Laws_of_Happiness_Lexicon",
  "laws": [
    {
      "law_number": 1,
      "name": "The Primacy of Personal Happiness (with Caveats)",
      "core_concept": "Personal happiness is paramount, but not at others' expense.",
      "book_definition_full": "Striving for your own happiness and well-being is a fundamental right and purpose; pursue what genuinely brings you joy. However, these 'caveats' are the crucial ethical handbrake. True, sustainable happiness isn't a zero-sum game; your joy shouldn't be built on someone else's misery."
    },
    {
      "law_number": 2,
      "name": "Non-Maleficence",
      "core_concept": "Don't intentionally cause unhappiness; avoid being a jerk.",
      "book_definition_full": "This is the 'don't be a jerk' law of happiness: your pursuit of bliss shouldn't make someone else do the ugly cry face. It's an active commitment to not being a walking, talking rain-cloud, recognizing that even small actions ripple outwards. Foster a world where we're all a little less likely to step on each other's emotional Lego bricks."
    },
    {
      "law_number": 3,
      "name": "Resilience and Self-Responsibility",
      "core_concept": "Own your emotional state; cultivate inner resilience.",
      "book_definition_full": "Don't hand over the keys to your emotional state to anyone else; your happiness is your gig. Cultivate the resilience of a cockroach in a nuclear apocalypse. This law is about taking ownership of your feelings and developing inner strength to weather life's punches without collapsing into a puddle of despair."
    },
    {
      "law_number": 4,
      "name": "Respect for Future Self",
      "core_concept": "Prioritize lasting happiness over fleeting gratification.",
      "book_definition_full": "Think long-term, grasshopper: don't let today's thrill become tomorrow's regret. Prioritize choices that cultivate lasting happiness over fleeting satisfaction. Ignoring your future self for instant gratification is like burning your furniture to stay warm for one night – it creates a bigger problem down the line."
    },
    {
      "law_number": 5,
      "name": "The Incremental Ascent",
      "core_concept": "Happiness grows incrementally; celebrate small wins, manage minor setbacks.",
      "book_definition_full": "Happiness is an incremental ascent, like collecting adult participation trophies. The real MVP of happiness is all those tiny, everyday wins adding up. Train your brain to spot and savor these micro-moments, and consciously choose not to let minor frustrations have an outsized impact. This elevates your baseline happiness over time."
    }
  ]
}
  ]
}