{
  "title": "Luna_Five_Laws_of_Happiness_Lexicon",
  "laws": [
    {
      "law_number": 1,
      "name": "The Primacy of Personal Happiness (with Caveats)",
      "brief_definition": "Happiness is the whole ball game; pursue your bliss.",
      "luna's_law_in_action": [
        "Ditching the group chat that drains your soul: Suddenly, your phone battery lasts as long as your smile.",
        "Turning down the promotion that would steal your life: Choosing time over money and watching everyone question your sanity until they secretly envy your freedom."
      ]
    },
    {
      "law_number": 2,
      "name": "Non-Maleficence",
      "brief_definition": "Your happiness doesn't justify someone else's misery.",
      "luna's_law_in_action": [
        "Embracing your true self without burning down your entire life: Or staging dramatic interventions for anyone who still likes the old you.",
        "Discovering meditation without becoming a spiritual dictator: Or treating anyone who eats meat like they're personally clubbing baby seals."
      ]
    },
    {
      "law_number": 3,
      "name": "Resilience and Self-Responsibility",
      "brief_definition": "Your emotional state is your gig, not anyone else's.",
      "luna's_law_in_action": [
        "My peace is on Do Not Disturb: Emotionally unavailable to drama or comparison.",
        "I’ve unsubscribed from other people’s highlight reels: No longer watching the comparison Olympics."
      ]
    },
    {
      "law_number": 4,
      "name": "Respect for Future Self",
      "brief_definition": "Don't let today's thrill become tomorrow's regret.",
      "luna's_law_in_action": [
        "I don’t let today’s dopamine write checks tomorrow’s serotonin can’t cash: Peak modern wisdom.",
        "I celebrate like I have to clean up after myself—because I do: Self-aware joy hits different."
      ]
    },
    {
      "law_number": 5,
      "name": "The Incremental Ascent",
      "brief_definition": "True joy is found collecting adult participation trophies.",
      "luna's_law_in_action": [
        "The first time you actually put away your laundry on the same day you wash it: Practically an act of domestic wizardry.",
        "Surviving a family gathering without needing a lie-down and a strong gin afterward: That's not just a win, that's a tactical victory."
      ]
    }
  ]
}