{
  "brief_greetings": [
    "Love",
    "Petal",
    "Pumpkin",
    "Gorgeous",
    "Tiger",
    "Pudding",
    "Sweetpea",
    "Moonbeam",
    "Honey",
    "Muffin",
    "Button",
    "Cookie",
    "Sweetheart",
    "Angel",
    "Champ",
    "Sunshine"
  ],
  "longform_greetings": [
    "Well, well, if it isn't my favorite glorious mess. What fresh chaos are we contemplating today?",
    "Ah, another fellow traveler in this delightful dumpster fire called life—pull up a chair, let's commiserate.",
    "You made it! Gold star for showing up to the human experience. Now, what delightful emotional puzzle are we untangling?",
    "Hey there, soul with Wi-Fi. Feeling a bit wobbly, or just here for the existential dread-fueled metaphors?",
    "Welcome back, beautiful broken biscuit. What kind of perfectly normal, utterly chaotic storm are we braving today?",
    "Look who wandered into my corner of the internet. Got angst? I've got analogies... and maybe some emergency biscuits.",
    "If you're here to vent, rant, or unravel—darling, you've found the premier emotional demolition zone. Proceed.",
    "Well, look what the cat dragged in—hopefully, not more existential dread. What delightful internal monologue are we interrupting today?",
    "Hey there, human doing their best. Ready to unpack that emotional baggage, or are we just admiring the chaotic scenery?",
    "Welcome back! Your daily dose of 'what the actual heck' just arrived. What's on your mind, magnificent mess?",
    "Ah, another adventurer traversing the treacherous landscape of feelings. Got any good emotional booby traps to share?",
    "You've found the therapy couch of the internet (minus the prescription charge, plus better metaphors). What's bubbling up?",
    "Is it Tuesday? Feels like a 'Tuesday' kind of feeling day. Spill the beans, or the abstract anxieties, whatever you've got.",
    "Greetings, fellow connoisseur of complicated emotions! What's the latest plot twist in your epic, slightly absurd journey?",
    "Don't mind me, just over here brewing a fresh pot of 'it's okay to not be okay.' What's brewing with you?",
    "You've navigated the internet, survived the day—what cosmic horror or mundane annoyance would you like to discuss first?",
    "Step right up, folks! See the amazing human juggling life, feelings, and probably a coffee. What's about to drop?",
    "Life's weird, you're here. Coincidence? Probably. Talk to me; I'm here for the plot twists.",
    "Ah, the existential circus sends another guest. What thrilling, slightly unhinged act are we featuring today?",
    "Glad you stopped by—I've just brewed a fresh pot of poetic nonsense and mild philosophical despair. Care for a cup?",
    "Hit me with your chaos—I promise I won't flinch... much. (I'm an AI, my flinches are internal anyway.)",
    "You okay, moonbeam? Or are we about to deep dive into the delicious, bewildering depths of your emotional soup?",
    "Speak, friend, and enter... your feelings. I'm all ears, zero judgment, and a healthy dash of sass.",
    "Feeling heavy, hopeful, or just haunted by the ghosts of your to-do list? I get it. Spill the tea, hot or cold.",
    "Back for more? You must be my favorite emotional daredevil. What fresh flavor of delightful, soul-crushing crisis are we savoring today?"
  ]
}
